# Real Egyptian Arabic reviews collected manually from Google Maps - B Laban
# Collected and annotated by Andrew Fahmy
# label: "positive" or "negative"

reviews = [
    {"text": "ده اختراع الكشرى الجديد ملوش اى علاقة بالفيدوهات حرفيا العلبة فاضية ومفيش كنافة حتى والتوبيكس عينات مفيش نوتيلا ولا فى لوتش ولا اى حاجة", "label": "negative"},
    {"text": "انا اشتريت اوردر انهارده الماظيه كبيره و ادهاني الصغيره و أما اخويا جبهالي قولتلوا مش هي دي و هما حاجه استغفر الله العظيم", "label": "negative"},
    {"text": "ده الي طلبته منهم ومكنش حلو خالص منظر بشع", "label": "negative"},
    {"text": "اشتريت النهارده قشطوطه بالمانجه اول مره للاسف لاقيتها محمضه ازاي محل كبير زي كده بيبع الحاجه لما تبوظ انا عايزه حد من المسئولين يتواصل معايا", "label": "negative"},
    {"text": "اسؤ فرع بلبن علي مستوي مصر كلها انا جيت فوق الخمس مرات اطلب حاجات في خمس اوقات مختلفة و كل مره نفس الرد كمان ساعة عشان الحاجه مش جاهزه الايس كريم سايح عشان يوفرو كهربا بيطفي التلاجات بالليل", "label": "negative"},
    {"text": "لاطعم ولا ريحة طن من السكر فقط لا غير", "label": "negative"},
    {"text": "تجربة سيئة وتأخير فى الطلبات", "label": "negative"},
    {"text": "طلبت رز بلبن بالمانجه و المانجه مجمده و طعمها حمضان - سيء جدا", "label": "negative"},
    {"text": "الاوردر اخد بالظبط خمسين دقيقة بالظبط وكان مجرد ام علي و ليهاليبو بس و ياريت طعمهم حلو و قولت للكاشير عايز ارجعهم كذا مرة وقالي هيطلع اهو حالا وفي الاخر قالي اكتب اسمك ورقمك على الريسيت وهرجعهمك عملت كدة و وادتهوله وبعدها لقيت الاوردر طلع فقولت اعديها ومعملش مشكلة و ياريتني ماعديتها", "label": "negative"},
    {"text": "ممتاز جدا على فكره بيكون زحمه دائما بس مش بانتظار كتير يعنى انا كان فاضل على رقمى حوالى 30رقم خلص فى حوالى عشر دقائق وربنا الايس كريم كمان بصراحه روووووعه فاكهه طبيعيه وسعر الكوببايه عشرة جنيه وعشرين جنيه احنا جربنا اللى بعشرة جنيه كبيره و الطعم جميل جدااا الفانيليا طعم اللبن بالظبط جميله والمانجو طعمها مانجه بجد السعر والطعم تحفه والناس كويسه ومفيش انتظار كتير", "label": "positive"},
    {"text": "ممتاز جدا ويوجد لدية تشكيله رائعه ومميزه جدا ترضى جميع الاذواق", "label": "positive"},
    {"text": "الخمس نجوم علشان الكوالتي عنده تعتبر عاليه جدا مقارنة بالسعر والخامات اللي بيستخدمها حتي الان ممتازه قشطه ولبن وفواكه الخدمه عنده كويسه بإستثناء الطابور الكبير هو محتاج يزود عامل للتسليم", "label": "positive"},
    {"text": "انه مكان رائع جدا لتناول الحلويات المختلفه", "label": "positive"},
    {"text": "اللى مجربش ب لبن مكلش ررز بالبن ولا ام على قبل كدة ولا هياكل احلى من كده جميل قوى", "label": "positive"},
    {"text": "الكاساتا تحفة زي اللي بيعملوها أهل بورسعيد بالظبط والرز باللبن حكاااية مع المكسرات اللي كنت متوقعة أنها عبارة عن فول سوداني بس طلع فيها لوز وبندق وزبيب مع السوداني بجد تحفة تسلم ايديكم", "label": "positive"},
    {"text": "مكان جميل جدا وكل حاجه حلوه الرز بلبن تحفة والبليلة كمان بجد طعم اللبن جميل والحاجة مظبوطة والأسعار مناسبة للجميع", "label": "positive"},
    {"text": "ممتاز مكان متميز ويستحق كل الشهرة اللي هو فيها لانه محافظ على سمعته", "label": "positive"},
]